import re
text = 'Разработка языка Python была начата в конце 1980-х годов сотрудником голландского института CWI Гвидо ван ' \
       'Россумом. Для распределённой ОС Amoeba требовался расширяемый скриптовый язык, и Гвидо начал писать Python на ' \
       'досуге, позаимствовав некоторые наработки для языка ABC (Гвидо участвовал в разработке этого языка, ' \
       'ориентированного на обучение программированию). В феврале 1991 года Гвидо опубликовал исходный текст в группе ' \
       'новостей alt.sources. Название языка произошло вовсе не от вида пресмыкающихся. Автор назвал язык в честь ' \
       'популярного британского комедийного телешоу 1970-х "Летающий цирк Монти Пайтона". '
# pattern = re.compile('\d+')
# pattern = re.compile("[A-Za-z]+")
# pattern = re.compile('\w*[а]\w\w[и]\w*')
pattern = re.compile('[АОЭЕИЫУЁЮЯ]\s[БВГДЖЗЙКЛМНПРСТФХЦЧШЩ]')

print(pattern.match(text))
print(pattern.search(text))
print(pattern.findall(text))
print(len(pattern.findall(text.upper())))